In [1]:
import numpy as np
from pandas import Series, DataFrame

In [2]:
import pandas as pd
from numpy.random import randn

In [4]:
ser = Series(np.random.randn(6), index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

ser

In [5]:
ser

1  a   -0.018942
   b   -0.497854
   c   -0.647034
2  a   -0.502889
   b    1.864299
   c    1.178104
dtype: float64

In [6]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [7]:
ser[1]

a   -0.018942
b   -0.497854
c   -0.647034
dtype: float64

In [8]:
ser[2]

a   -0.502889
b    1.864299
c    1.178104
dtype: float64

In [9]:
ser

1  a   -0.018942
   b   -0.497854
   c   -0.647034
2  a   -0.502889
   b    1.864299
   c    1.178104
dtype: float64

In [10]:
ser[1]['a']

-0.018942172919290592

In [11]:
ser[:,'a']

1   -0.018942
2   -0.502889
dtype: float64

In [12]:
dframe = ser.unstack()

In [13]:
dframe

          a         b         c
1 -0.018942 -0.497854 -0.647034
2 -0.502889  1.864299  1.178104

In [14]:
dframe.unstack()

a  1   -0.018942
   2   -0.502889
b  1   -0.497854
   2    1.864299
c  1   -0.647034
   2    1.178104
dtype: float64

In [15]:
dframe.T.unstack()

1  a   -0.018942
   b   -0.497854
   c   -0.647034
2  a   -0.502889
   b    1.864299
   c    1.178104
dtype: float64

In [16]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [17]:
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [18]:
dframe2.index.names = ['INDEX1','INDEX_2']

In [19]:
dframe2

                 NY      LA   SF
               cold hot hot cold
INDEX1 INDEX_2
a      1          0   1   2    3
       2          4   5   6    7
b      1          8   9  10   11
       2         12  13  14   15

In [20]:
dframe2.columns.names = ['Cities','Temp']

In [21]:
dframe2

Cities           NY      LA   SF
Temp           cold hot hot cold
INDEX1 INDEX_2
a      1          0   1   2    3
       2          4   5   6    7
b      1          8   9  10   11
       2         12  13  14   15

In [22]:
dframe2.swaplevel('Cities','Temp', axis=1)

Temp           cold hot     cold
Cities           NY  NY  LA   SF
INDEX1 INDEX_2
a      1          0   1   2    3
       2          4   5   6    7
b      1          8   9  10   11
       2         12  13  14   15

In [28]:
dframe2

Cities           NY      LA   SF
Temp           cold hot hot cold
INDEX1 INDEX_2
a      1          0   1   2    3
       2          4   5   6    7
b      1          8   9  10   11
       2         12  13  14   15

In [3]:
dframe2.sort_index(level=1)

NameError: name 'dframe2' is not defined

In [4]:
dframe2

NameError: name 'dframe2' is not defined